## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories.github_repository_file.commits_checks["application"] must be replaced
-/+ resource "github_repository_file" "commits_checks" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "c0c80a361fbe1f2404cf3a7ca66dcbf9924c0034" -> (known after apply)
      ~ file                            = ".github/workflows/commits-checks.yml" -> ".github/workflows/commits-checks.yaml" # forces replacement
      ~ id                              = "application/.github/workflows/commits-checks.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "7bbb4e1222c3ad1aa1775ff64e9c9e4dd5c20be0" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.commits_checks["infrastructure"] must be replaced
-/+ resource "github_repository_file" "commits_checks" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "4a13c2b303b00991413aff44a678970db2e26437" -> (known after apply)
      ~ file                            = ".github/workflows/commits-checks.yml" -> ".github/workflows/commits-checks.yaml" # forces replacement
      ~ id                              = "infrastructure/.github/workflows/commits-checks.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "7bbb4e1222c3ad1aa1775ff64e9c9e4dd5c20be0" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.commits_checks["website"] must be replaced
-/+ resource "github_repository_file" "commits_checks" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "ae41a677babf10dd7667dc7cebf410c3524f814d" -> (known after apply)
      ~ file                            = ".github/workflows/commits-checks.yml" -> ".github/workflows/commits-checks.yaml" # forces replacement
      ~ id                              = "website/.github/workflows/commits-checks.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "7bbb4e1222c3ad1aa1775ff64e9c9e4dd5c20be0" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.pr_issues_project["application"] must be replaced
-/+ resource "github_repository_file" "pr_issues_project" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "85fb6f1d1670dd0692cdf43d5ff1a6ceeafe863a" -> (known after apply)
      ~ file                            = ".github/workflows/pr-issues-project.yml" -> ".github/workflows/pr-issues-project.yaml" # forces replacement
      ~ id                              = "application/.github/workflows/pr-issues-project.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "b07fec78cb41def3f2979c14d2cbb894063e02d7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.pr_issues_project["infrastructure"] must be replaced
-/+ resource "github_repository_file" "pr_issues_project" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "d36aed79bd7ad0efd2854c5cabb7602964c14a34" -> (known after apply)
      ~ file                            = ".github/workflows/pr-issues-project.yml" -> ".github/workflows/pr-issues-project.yaml" # forces replacement
      ~ id                              = "infrastructure/.github/workflows/pr-issues-project.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "b07fec78cb41def3f2979c14d2cbb894063e02d7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.pr_issues_project["website"] must be replaced
-/+ resource "github_repository_file" "pr_issues_project" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "4dad6aadbfdbcec56f35cf047bac4a1cd4d2d281" -> (known after apply)
      ~ file                            = ".github/workflows/pr-issues-project.yml" -> ".github/workflows/pr-issues-project.yaml" # forces replacement
      ~ id                              = "website/.github/workflows/pr-issues-project.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "b07fec78cb41def3f2979c14d2cbb894063e02d7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.release_please["application"] must be replaced
-/+ resource "github_repository_file" "release_please" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "d70eb9b022ffee1a9d46832c6bd8014dc640f115" -> (known after apply)
      ~ file                            = ".github/workflows/release-please.yml" -> ".github/workflows/release-please.yaml" # forces replacement
      ~ id                              = "application/.github/workflows/release-please.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "85c2c4eebed423d5a48303137c7ff453748554f3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.release_please["infrastructure"] must be replaced
-/+ resource "github_repository_file" "release_please" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "7a371b2a2666fce2520acaec03294c425cc325c1" -> (known after apply)
      ~ file                            = ".github/workflows/release-please.yml" -> ".github/workflows/release-please.yaml" # forces replacement
      ~ id                              = "infrastructure/.github/workflows/release-please.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "85c2c4eebed423d5a48303137c7ff453748554f3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.repositories.github_repository_file.release_please["website"] must be replaced
-/+ resource "github_repository_file" "release_please" {
      + autocreate_branch_source_sha    = (known after apply)
      ~ commit_sha                      = "1b938f11580a5310eb049e1441f8565f161644c7" -> (known after apply)
      ~ file                            = ".github/workflows/release-please.yml" -> ".github/workflows/release-please.yaml" # forces replacement
      ~ id                              = "website/.github/workflows/release-please.yml" -> (known after apply)
      ~ ref                             = "main" -> (known after apply)
      ~ sha                             = "85c2c4eebed423d5a48303137c7ff453748554f3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.users_and_teams.github_team_members.default_team["read"] will be updated in-place
  ~ resource "github_team_members" "default_team" {
        id      = "13560339"
        # (1 unchanged attribute hidden)

      + members {
          + role     = "member"
          + username = "GeraudSilvestri"
        }
      + members {
          + role     = "member"
          + username = "Rostand"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.
```
</details>